# This file is managed with cog.
#
# To regenerate it, run:
#   cog -r Brewfile

# Taps
# (uses brew tap)
# [[[cog
import subprocess
import cog
taps = subprocess.check_output(['brew', 'tap']).decode().strip().split('\n')
taps.sort()
for tap in taps:
    cog.outl(f'tap "{tap}"')
# ]]]
tap "atlassian/acli"
tap "azure/functions"
tap "cloudflare/cloudflare"
tap "hashicorp/tap"
tap "mongodb/brew"
tap "thiagowfx/pancake"
tap "thiagowfx/taps"
# [[[end]]]

# Brew packages
# (uses brew leaves --installed-on-request to list only explicitly requested packages)
# Alternative: brew bundle dump (includes transitive dependencies)
# [[[cog
import subprocess
import cog
packages = subprocess.check_output(['brew', 'leaves', '--installed-on-request']).decode().strip().split('\n')
packages.sort()
for pkg in packages:
    cog.outl(f'brew "{pkg}"')
# ]]]
brew "ack"
brew "actionlint"
brew "argocd"
brew "atlassian/acli/acli"
brew "atool"
brew "atuin"
brew "aws-sso-cli"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-completion@2"
brew "bash-language-server"
brew "bkt"
brew "broot"
brew "btop"
brew "ccusage"
brew "chart-testing"
brew "checkov"
brew "clang-format"
brew "codebook-lsp"
brew "codespell"
brew "cogapp"
brew "cookiecutter"
brew "coreutils"
brew "diffoscope"
brew "difftastic"
brew "direnv"
brew "diskonaut"
brew "dive"
brew "dockerfmt"
brew "dos2unix"
brew "dotenv-linter"
brew "entr"
brew "eslint"
brew "expect"
brew "eza"
brew "fastfetch"
brew "fd"
brew "flock"
brew "folderify"
brew "fpp"
brew "fx"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "gitui"
brew "gnu-sed"
brew "go"
brew "graphviz"
brew "hadolint"
brew "hashicorp/tap/vault"
brew "htop"
brew "httpie"
brew "hugo"
brew "icdiff"
brew "imagemagick"
brew "ipython"
brew "jj"
brew "jq"
brew "jsonlint"
brew "just"
brew "keep-sorted"
brew "kubeconform"
brew "kustomize"
brew "less"
brew "lesspipe"
brew "lf"
brew "llm"
brew "ls-lint"
brew "lua-language-server"
brew "macos-trash"
brew "make"
brew "marksman"
brew "mas"
brew "mdsh"
brew "midnight-commander"
brew "miller"
brew "mimirtool"
brew "mongodb-atlas-cli"
brew "moreutils"
brew "mr"
brew "mtr"
brew "ncdu"
brew "neovim"
brew "opencode"
brew "optipng"
brew "pngcrush"
brew "poppler"
brew "pre-commit"
brew "prometheus"
brew "proselint"
brew "pyright"
brew "ranger"
brew "rbenv"
brew "rename"
brew "ripgrep-all"
brew "ruff"
brew "skopeo"
brew "starship"
brew "stow"
brew "tailspin"
brew "terraform-docs"
brew "terraform-ls"
brew "terrascan"
brew "tfenv"
brew "tflint"
brew "tfupdate"
brew "thiagowfx/pancake/pancake"
brew "thiagowfx/taps/python-is-python3"
brew "tig"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "tree-sitter-cli"
brew "trivy"
brew "ty"
brew "typst"
brew "uv"
brew "vim"
brew "vscode-langservers-extracted"
brew "watch"
brew "watchexec"
brew "wget"
brew "yaml-language-server"
brew "yamlfmt"
brew "yamllint"
brew "yarn"
brew "yq"
brew "zizmor"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
# [[[end]]]

# Brew Casks
# (uses brew list --cask)
# [[[cog
import subprocess
import cog
casks = subprocess.check_output(['brew', 'list', '--cask']).decode().strip().split('\n')
casks.sort()
for cask in casks:
    cog.outl(f'cask "{cask}"')
# ]]]
cask "1password"
cask "1password-cli"
cask "anki"
cask "brave-browser"
cask "bruno"
cask "burp-suite"
cask "calibre"
cask "codex"
cask "conductor"
cask "dbeaver-community"
cask "duckduckgo"
cask "element"
cask "espanso"
cask "finicky"
cask "flameshot"
cask "font-cascadia-code"
cask "font-commit-mono"
cask "font-hermit"
cask "font-ibm-plex-mono"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "heynote"
cask "hiddenbar"
cask "jellyfin"
cask "karabiner-elements"
cask "little-snitch"
cask "logseq"
cask "maccy"
cask "microsoft-azure-storage-explorer"
cask "pgadmin4"
cask "postico"
cask "pritunl"
cask "qbittorrent"
cask "rancher"
cask "raycast"
cask "rectangle"
cask "slack"
cask "spotify"
cask "swiftbar"
cask "tailscale-app"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "windscribe"
cask "zed"
# [[[end]]]
