{
  "ale": {
    "branch": "master"
  },
  "diffconflicts": {
    "branch": "master"
  },
  "file-line": {
    "branch": "main"
  },
  "fzf": {
    "branch": "master"
  },
  "gitsigns.nvim": {
    "branch": "main"
  },
  "leap.nvim": {
    "branch": "main"
  },
  "lualine.nvim": {
    "branch": "master"
  },
  "nvim-surround": {
    "branch": "main"
  },
  "onedark": {
    "branch": "main"
  },
  "vim-easy-align": {
    "branch": "master"
  },
  "vim-endwise": {
    "branch": "master"
  },
  "vim-eunuch": {
    "branch": "master"
  },
  "vim-fugitive": {
    "branch": "master"
  },
  "vim-mkdir": {
    "branch": "main"
  },
  "vim-repeat": {
    "branch": "master"
  },
  "vim-slash": {
    "branch": "master"
  },
  "vim-symlink": {
    "branch": "master"
  },
  "vim-trailing-whitespace": {
    "branch": "master"
  },
  "vim-unimpaired": {
    "branch": "master"
  },
  "vim-vinegar": {
    "branch": "master"
  }
}
