tap "beeftornado/rmtree"
tap "buo/cask-upgrade"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/science"
tap "homebrew/services"
brew "ack"
brew "archey"
brew "python"
brew "bash"
brew "bash-completion@2"
brew "certbot"
brew "clang-format"
brew "cmake", args: ["with-completion"]
brew "colordiff"
brew "coreutils"
brew "cowsay"
brew "dtrx"
brew "elinks"
brew "emacs"
brew "espeak"
brew "findutils"
brew "fish"
brew "fortune"
brew "fzf"
brew "git-cal"
brew "gnu-sed"
brew "gnupg"
brew "htop"
brew "icdiff"
brew "imagemagick"
brew "jed"
brew "jq"
brew "libatomic_ops"
brew "mas"
brew "maven"
brew "mercurial"
brew "mg"
brew "midnight-commander"
brew "python3"
brew "mobile-shell"
brew "monetdb"
brew "moreutils"
brew "mr"
brew "mtr"
brew "multitail"
brew "ncdu"
brew "nmap"
brew "pacapt"
brew "peco"
brew "pinentry-mac"
brew "pstree"
brew "ranger"
brew "rcs"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "screenfetch"
brew "shellcheck"
brew "source-highlight"
brew "speedtest_cli"
brew "stormssh"
brew "stow"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tmux"
brew "trash"
brew "tree"
brew "v"
brew "vim", args: ["with-lua"]
brew "watch"
brew "wget"
brew "wgetpaste"
brew "youtube-dl"
cask "1clipboard"
cask "1password"
cask "adobe-acrobat-reader"
cask "appcleaner"
cask "avidemux"
cask "calibre"
cask "cyberduck"
cask "deezer"
cask "docker"
cask "epubquicklook"
cask "font-consolas-for-powerline"
cask "font-pt-mono"
cask "font-pt-sans"
cask "font-pt-serif"
cask "gimp"
cask "github-desktop"
cask "google-drive"
cask "insomnia"
cask "keepingyouawake"
cask "keybase"
cask "libreoffice"
cask "lyx"
cask "macdown"
cask "mactex"
cask "mpv"
cask "ngrok"
cask "nosleep"
cask "paintbrush"
cask "plex-media-server"
cask "qbittorrent"
cask "qlmarkdown"
cask "quicklook-csv"
cask "quicklook-json"
cask "skype"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "sublime-text"
cask "telegram-desktop"
cask "textmate"
cask "the-unarchiver"
cask "torbrowser"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "webtorrent"
cask "whatsapp"
cask "windscribe"
cask "wireshark"
cask "yujitach-menumeters"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Microsoft Remote Desktop", id: 715768417
mas "Xcode", id: 497799835
