tap 'beeftornado/rmtree'
tap 'buo/cask-upgrade'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/command-not-found'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/science'
cask 'mactex'
brew 'ack'
brew 'archey'
brew 'python'
brew 'autojump'
brew 'bash'
brew 'bash-completion@2'
brew 'clang-format'
brew 'cmake', args: ['with-completion']
brew 'colordiff'
brew 'coreutils'
brew 'cowsay'
brew 'dtrx'
brew 'elinks'
brew 'emacs'
brew 'espeak'
brew 'ffind'
brew 'fish'
brew 'fortune'
brew 'fzf'
brew 'gnupg'
brew 'htop'
brew 'icdiff'
brew 'imagemagick'
brew 'libatomic_ops'
brew 'mas'
brew 'maven'
brew 'mercurial'
brew 'mobile-shell'
brew 'monetdb'
brew 'moreutils'
brew 'mtr'
brew 'multitail'
brew 'ncdu'
brew 'nmap'
brew 'pacapt'
brew 'tree'
brew 'pass'
brew 'pinentry-mac'
brew 'pstree'
brew 'ranger'
brew 'rcs'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'screenfetch'
brew 'speedtest_cli'
brew 'stormssh'
brew 'stow'
brew 'the_silver_searcher'
brew 'thefuck'
brew 'tig'
brew 'tmux'
brew 'trash'
brew 'vim', args: ['with-lua']
brew 'watch'
brew 'wget'
brew 'youtube-dl'
brew 'homebrew/science/graph-tool'
cask '1clipboard'
cask '1password'
cask 'appcleaner'
cask 'calibre'
cask 'cyberduck'
cask 'deezer'
cask 'epubquicklook'
cask 'gimp'
cask 'google-drive'
cask 'keepingyouawake'
cask 'keybase'
cask 'libreoffice'
cask 'lyx'
cask 'macdown'
cask 'mpv'
cask 'nosleep'
cask 'paintbrush'
cask 'plex-media-server'
cask 'qbittorrent'
cask 'qlmarkdown'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'rescuetime'
cask 'skype'
cask 'sourcetree'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'telegram-desktop'
cask 'textmate'
cask 'the-unarchiver'
cask 'torbrowser'
cask 'visual-studio-code'
cask 'vlc'
cask 'vmware-fusion'
cask 'webtorrent'
cask 'whatsapp'
cask 'windscribe'
cask 'wireshark'
cask 'yujitach-menumeters'
mas 'GarageBand', id: 682658836
mas 'iMovie', id: 408981434
mas 'Microsoft Remote Desktop', id: 715768417
mas 'Xcode', id: 497799835
